// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// let arr1 = [1, 2, 3, 4, 5];
// let arr2 = ['6', '7', '8', '9', '10'];
// let arr3 = ['11', '12', '13', '14', '15', 16, 17, 18, 19, 20, true, false];
// console.log(arr1, arr2, arr3);

// -- Створити пустий масив. Наповнити його будь-якими значеннями
// звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// arr[3] = 4;
// arr[4] = 5;
// console.log(arr);
//
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// for (let i = 0; i < 10 ; i++) {
//     document.write(`<div>Hello okten </div>`)
// }
//
// for (let i = 0; i < 10 ; i++) {
//     document.write(`<div>Hello okten ${i} </div>`)
// }
// let blocks = 0
// while (blocks < 20) {
//     document.write(`<h1>Hello world </h1>`)
//     blocks++
// }
// let block = 0
// while (block < 20) {
//     document.write(`<h1>Hello world ${block} </h1>`)
//     block++
// }

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//

// let arr1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i = 0;i < arr1.length; i++) {
//     console.log(arr1[i])
// }
// let arr2 = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'];
// for (let i = 0;i < arr2.length; i++) {
//     console.log(arr2[i])
// }
// let arr3 = ['1', 2, 'three', 'чотири', '5', 6, 'seven', 'вісім', true, false];
// for (let i = 0;i < arr3.length; i++) {
//     console.log(arr3[i])
// }

// let arr1 = ['1', 2, 'three', 'чотири', '5', 6, 'seven', 'вісім', true, false];
// for (let i = 0; i < arr1.length; i++) {
//     if (typeof arr1[i] == "boolean") {
//         console.log(arr1[i])
//     }
// }
// let arr2 = ['1', 2, 'three', 'чотири', '5', 6, 'seven', 'вісім', true, false];
// for (let i = 0; i < arr2.length; i++) {
//     if (typeof arr2[i] == "number") {
//         console.log(arr2[i])
//     }
// }
// let arr3 = ['1', 2, 'three', 'чотири', '5', 6, 'seven', 'вісім', true, false];
// for (let i = 0; i < arr3.length; i++) {
//     if (typeof arr3[i] == "string") {
//         console.log(arr3[i])
//     }
// }
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// let arr = [];
// arr[0] = 1;
// arr[1] = '2';
// arr[2] = 'three';
// arr[3] = 4;
// arr[4] = '5';
// arr[5] = 'six';
// arr[6] = '7';
// arr[7] = 8;
// arr[8] = true;
// arr[9] = false;
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// for (let i = 0; i < 10; i++) {
//     console.log(i);
//     document.write(i);
// }
// for (let it = 0; it < 100; it++) {
//     console.log(it);
//     document.write(it);
// }

// for (let i = 0; i < 200; i+=2) {
//     console.log(i)
//     document.write(i)
// }

// for (let i = 0; i < 100; i++) {
//     if (i % 2 === 0) {
//         console.log(i);
//         document.write(i);
//     }
// }

// for (let i = 0; i < 100; i++) {
//     if (i % 2 !== 0) {
//         console.log(i);
//         document.write(i);
//     }
// }