// // 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
// let arr = [];
// for(let i = 1; i<11;i++) {
//     arr.push(i)
// }
// console.log(arr)
// let result = 0;
//     for (let elements = 0; elements <= arr.length - 1; elements++) {
//         result += arr[elements]
//     }
//     console.log(result)
//
// // 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
//
// let book = {
//         name: 'букварик',
//         pages: 100,
//         genre: 'epic'
// }
//
// // 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
//
// let b00k = {
//     name: 'букварик',
//     pages: 100,
//     genre: 'epic',
//     authors: ['Олександр Карпів', 'Юрій Давид']
// }
//
// // 4. Створити масив об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
//
// let library = [book, b00k];
// for (let item of library) {
//     console.log(item)
// }
//
// // 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// // Значення площі зберігати в змінній s.
//
// let height = 23;
// let width = 10;
// let s = height*width;
// console.log(s);

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let heightC = 10;
// let diametr = 4;
// let radius = diametr/2;
// let v = 3.14*radius**2*heightC;
// console.log(v);

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

let n = 3;
let m = 4;
let k = Math.sqrt(n**2+m**2);
console.log(k);

