// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a = 5;
// let b = 10;
// if (a > b) {
//     console.log(a)
// } else if (a < b) {
//     console.log(b)
// } else {
//     console.log(a);
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let apart = Number(prompt('Введіть номер квартири'));
// if (apart <= 20) {
//     console.log('Перший підїзд')
// } else if (apart <= 48) {
//     console.log('Другий підїзд')
// } else  if (apart <= 90) {
//     console.log('Третій підїзд')
// } else{
//     console.log('Квартири не існує')
// }

//
// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = Number(prompt('введіть число'));
// if (number === 10) {
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')
// }
//
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x = 1;
// if (typeof x === "number" ) {
//     console.log(1);
// } else if (typeof x === "string") {
//     console.log(2);
// } else if (typeof x === "boolean") {
//     console.log(3);
// } else if (typeof x === "object") {
//     console.log(3);
// }

// -Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let x = Number(prompt('Введіть температуру'));
// if (x > 10 && x > 22) {
//     console.log('Ми йдемо вчитися! Ура!');
// } else {
//     console.log('Ми не йдемо вчитися!');
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести
//     Повідомлення - що число не вірне ... .

// switch (Number(prompt('ввеіть число'))) {
//     case 1 :
//         console.log('Вітаю! Ви виграли автомобіль!');
//         break;
//     case 2 :
//         console.log('Вітаю! Ви виграли мотоцикл!');
//         break;
//     case 3 :
//         console.log('Вітаю! Ви виграли телефон!');
//         break;
//     case 4 :
//         console.log('Вітаю! Ви виграли квартиру!');
//         break;
//     case 5 :
//         console.log('Вітаю! Ви виграли багато грошей!');
//         break;
//     default:
//         console.log('Число невірне');
// }


