// - Дано натуральное число n. Выведите все числа от 1 до n.
//
// let n = (number) => {
//     for (let i = 1; i < number; i++) {
//         console.log(i)
//     }
// }
// console.log(n(6));
//
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
// let fu = (a,b) => {
//     if (a < b) {
//         for (let i = a; i <= b; i++) {
//             console.log(i);
//         }
//     } else {
//         for (let i = a; i >= b; i--) {
//             console.log(i);
//         }
//     }
// }
// fu(15, 1);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// let foo = (array,number) => {
//     let x = array[number]
//     array[number] = array[number +1]
//     array[number + 1] = x;
//     console.log(array);
// }
// foo([9, 8, 0, 4], 2);
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]
//
// let fun = (array) => {
//     let x = [];
//     let y = [];
//     for (let i = 0; i < array.length; i++) {
//         if (array[i] === 0) {
//             y.push(0)
//         } else {
//             x.push(array[i])
//         }
//     }
//     let z = x.concat(y);
//     return z
// }
// console.log(fun([1, 0, 3, 5, 6, 2, 0]));