// // - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
// // до якої четверті години попадає число
// // (в першу, другу, третю или четверту частину години).
//
// let time = prompt('Введіть хвилину')
// if (time <= 15 ) {
//     console.log('1 чверть')
// } else if (time <= 30) {
//     console.log('2 чверть')
// } else if (time <= 45) {
//     console.log('3 чверть')
// } else if (time < 60) {
//     console.log('4 чверть')
// }
//
// // - У змінній day дано якесь число від 1 до 31.
// // Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
//
// let day = prompt('Введіть число')
// if (day <= 10 ) {
//     console.log('Перша декада')
// } else if (day <= 20) {
//     console.log('Друга декада')
// } else if (day <= 31) {
//     console.log('Третя декада')
// }
//
// // - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// //     Перевірте роботу скрипта при test, що дорівнює true, false.
// //     Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// let test = true;
// if (!test ) {
//     console.log('Вірно')
// } else {
//     console.log('Неправильно')
// }
//
// let test = true;
// let x = test ? 'Неправильно' : 'Вірно'
// console.log(x);
//
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
// let a = 1;
// if (a) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// }
//
// - Скласти розклад на тиждень за домопоги switch.
//     Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// switch (+prompt('Введіть номер дня тижня')) {
//     case 1:
//         console.log('Купити продукти');
//         break;
//
//     case 2 :
//         console.log('Зробити ДЗ');
//         break;
//     case 3 :
//         console.log('Поспати');
//         break;
//     case 4 :
//         console.log('Поїсти');
//         break;
//     case 5 :
//         console.log('Попити');
//         break;
//     case 6 :
//         console.log("Подивитися прев'ю по ДЖС");
//         break;
//     case 7 :
//         console.log('Нічого не робити');
//         break;
// }

// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
// let year = 2004 % 4 ? 'Рік - не високосний' : 'Рік - високосний';
// console.log(year);

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let qwe = prompt('Яка «офіційна» назва JavaScript?');
// if(qwe === 'ECMAScript') {
//     console.log('Правильно!');
// } else {
//     console.log('Не знаєте? ECMAScript!');
// }

