// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera","Ira"];
// if (friends.length >= 3) {
//     console.log('це великий масив, в якому  3 і більше елементи.');
// } else {
//     console.log('це маленький масив, в якому менше 3-х елементів.');
// }
//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = Number(prompt('введіть перше число'));
// let b = Number(prompt('введіть друге число'));
// let c = Number(prompt('введіть третє число'));
// if ((a > b && a < c ) || (a > c && a < b)) {
//     console.log(a);
// } else if ((b > a && b < c ) || (b < a && b > c)) {
//     console.log(b);
// } else  {
//     console.log(c);
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// let a = 1;
// let b = 2;
// let result;
// (a + b) < 4 ? console.log('Мало') : console.log('Багато');
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let a =Number (prompt('введіть число'));
// a >= -100 && a < 0 ? console.log('Число - негативне') : a === 0 ? console.log('Число дорівнює нулю') : a > 0 && a <= 100 ? console.log('Число - позитивне') : console.log('Число не підходить');
